CSI API ETABS v1
cCaseStaticNonlinearStaged.SetStageDefinitions_2 Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetStageDefinitions_2(
	string Name,
	int NumberStages,
	ref double[] Duration,
	ref bool[] Output,
	ref string[] OutputName,
	ref string[] Comment
)
Function SetStageDefinitions_2 (
	Name As String,
	NumberStages As Integer,
	ByRef Duration As Double(),
	ByRef Output As Boolean(),
	ByRef OutputName As String(),
	ByRef Comment As String()
) As Integer
Dim instance As cCaseStaticNonlinearStaged
Dim Name As String
Dim NumberStages As Integer
Dim Duration As Double()
Dim Output As Boolean()
Dim OutputName As String()
Dim Comment As String()
Dim returnValue As Integer
returnValue = instance.SetStageDefinitions_2(Name,
	NumberStages, Duration, Output, OutputName,
	Comment)
int SetStageDefinitions_2(
	String^ Name,
	int NumberStages,
	array<double>^% Duration,
	array<bool>^% Output,
	array<String^>^% OutputName,
	array<String^>^% Comment
)
abstract SetStageDefinitions_2 :
        Name : string *
        NumberStages : int *
        Duration : float[] byref *
        Output : bool[] byref *
        OutputName : string[] byref *
        Comment : string[] byref -> int
Parameters
Name
Type: System.String
NumberStages
Type: System.Int32
Duration
Type: System.Double[]
Output
Type: System.Boolean[]
OutputName
Type: System.String[]
Comment
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinearStaged Interface
ETABSv1 Namespace